In [4]:
import pandas as pd
import numpy as np

In [6]:
from numpy.random import randn
np.random.seed(101)

In [9]:
df = pd.DataFrame(randn(5,4),index='A B C D E'.split(),columns='W X Y Z'.split())

In [11]:
df

          W         X         Y         Z
A -0.993263  0.196800 -1.136645  0.000366
B  1.025984 -0.156598 -0.031579  0.649826
C  2.154846 -0.610259 -0.755325 -0.346419
D  0.147027 -0.479448  0.558769  1.024810
E -0.925874  1.862864 -1.133817  0.610478

In [13]:
df['W']

A   -0.993263
B    1.025984
C    2.154846
D    0.147027
E   -0.925874
Name: W, dtype: float64

In [15]:
df[['W','Z']]

          W         Z
A -0.993263  0.000366
B  1.025984  0.649826
C  2.154846 -0.346419
D  0.147027  1.024810
E -0.925874  0.610478

In [26]:
df

          W         X         Y         Z
A -0.993263  0.196800 -1.136645  0.000366
B  1.025984 -0.156598 -0.031579  0.649826
C  2.154846 -0.610259 -0.755325 -0.346419
D  0.147027 -0.479448  0.558769  1.024810
E -0.925874  1.862864 -1.133817  0.610478

In [28]:
df > 0

       W      X      Y      Z
A  False   True  False   True
B   True  False  False   True
C   True  False  False  False
D   True  False   True   True
E  False   True  False   True

In [29]:
df[df>0]

          W         X         Y         Z
A       NaN  0.196800       NaN  0.000366
B  1.025984       NaN       NaN  0.649826
C  2.154846       NaN       NaN       NaN
D  0.147027       NaN  0.558769  1.024810
E       NaN  1.862864       NaN  0.610478

In [31]:
## extract rows from df1 where W has values > 0
df[df['W']>0]

          W         X         Y         Z
B  1.025984 -0.156598 -0.031579  0.649826
C  2.154846 -0.610259 -0.755325 -0.346419
D  0.147027 -0.479448  0.558769  1.024810

In [33]:
## extract all rows from column Y where 'W' value is > 0
df[df['W']>0]['Y']

B   -0.031579
C   -0.755325
D    0.558769
Name: Y, dtype: float64

In [35]:
result = df[df['W']>0]
print(result)

### GIVE ME ALL ROWS FROM A DATA FRAME WHERE COL W HAS GREATER THAN 0

## SIMILAR TO SELECT * FROM TABLE TABLENAME WHERE W>0

          W         X         Y         Z
B  1.025984 -0.156598 -0.031579  0.649826
C  2.154846 -0.610259 -0.755325 -0.346419
D  0.147027 -0.479448  0.558769  1.024810

In [36]:
result['Y']

B   -0.031579
C   -0.755325
D    0.558769
Name: Y, dtype: float64

In [40]:
### easier way of doing the above
df[df['W']>0]['Y']

B   -0.031579
C   -0.755325
D    0.558769
Name: Y, dtype: float64

In [41]:
df[df['W']>0]['W']

B    1.025984
C    2.154846
D    0.147027
Name: W, dtype: float64

In [45]:
### select Y and Z where W values are greater than 0
df[df['W']>0][['Y','Z']]

          Y         Z
B -0.031579  0.649826
C -0.755325 -0.346419
D  0.558769  1.024810

In [46]:
df

          W         X         Y         Z
A -0.993263  0.196800 -1.136645  0.000366
B  1.025984 -0.156598 -0.031579  0.649826
C  2.154846 -0.610259 -0.755325 -0.346419
D  0.147027 -0.479448  0.558769  1.024810
E -0.925874  1.862864 -1.133817  0.610478

In [44]:
### MULTIPLE CONDITIONS
### note the amperesand (&) symbol for "and" and the pipe "|" symbol for "or"
df[(df['W']>0) & (df['Y'] > 1)]

Empty DataFrame
Columns: [W, X, Y, Z]
Index: []

In [47]:
df[(df['W']>0) | (df['Y'] > 1)]

          W         X         Y         Z
B  1.025984 -0.156598 -0.031579  0.649826
C  2.154846 -0.610259 -0.755325 -0.346419
D  0.147027 -0.479448  0.558769  1.024810

In [48]:
df

          W         X         Y         Z
A -0.993263  0.196800 -1.136645  0.000366
B  1.025984 -0.156598 -0.031579  0.649826
C  2.154846 -0.610259 -0.755325 -0.346419
D  0.147027 -0.479448  0.558769  1.024810
E -0.925874  1.862864 -1.133817  0.610478

In [49]:
### how to reset the index - reset_index method
df.reset_index()

  index         W         X         Y         Z
0     A -0.993263  0.196800 -1.136645  0.000366
1     B  1.025984 -0.156598 -0.031579  0.649826
2     C  2.154846 -0.610259 -0.755325 -0.346419
3     D  0.147027 -0.479448  0.558769  1.024810
4     E -0.925874  1.862864 -1.133817  0.610478

In [ ]:
### to permanently replace the index use as below
# df.reset_index(inplace=True)

In [68]:
newind = 'CA NY LA WY OR'
print(newind)
print(type(newind))

CA NY LA WY OR
<class 'str'>

In [69]:
### split the string
newind.split()

['CA', 'NY', 'LA', 'WY', 'OR']

In [71]:
### smart coding
newind = 'CA NY LA WY OR'.split()

In [72]:
print(newind)
print(type(newind))

['CA', 'NY', 'LA', 'WY', 'OR']
<class 'list'>

In [73]:
###  add a new column called States to the data frame df
### populate that column with values from the list newind

df['States'] = newind

In [74]:
df

          W         X         Y         Z States
A -0.993263  0.196800 -1.136645  0.000366     CA
B  1.025984 -0.156598 -0.031579  0.649826     NY
C  2.154846 -0.610259 -0.755325 -0.346419     LA
D  0.147027 -0.479448  0.558769  1.024810     WY
E -0.925874  1.862864 -1.133817  0.610478     OR

In [76]:
### if we want to set the column State as an index for rows
df.set_index('States')

               W         X         Y         Z
States
CA     -0.993263  0.196800 -1.136645  0.000366
NY      1.025984 -0.156598 -0.031579  0.649826
LA      2.154846 -0.610259 -0.755325 -0.346419
WY      0.147027 -0.479448  0.558769  1.024810
OR     -0.925874  1.862864 -1.133817  0.610478

####### Both setting and resetting are not permanent because the parameter inplace = False is default
        in reset_index and set_index methods

In [78]:
## reset index
df.reset_index()

  index         W         X         Y         Z States
0     A -0.993263  0.196800 -1.136645  0.000366     CA
1     B  1.025984 -0.156598 -0.031579  0.649826     NY
2     C  2.154846 -0.610259 -0.755325 -0.346419     LA
3     D  0.147027 -0.479448  0.558769  1.024810     WY
4     E -0.925874  1.862864 -1.133817  0.610478     OR

In [80]:
### set State as index
df.set_index('States')

               W         X         Y         Z
States
CA     -0.993263  0.196800 -1.136645  0.000366
NY      1.025984 -0.156598 -0.031579  0.649826
LA      2.154846 -0.610259 -0.755325 -0.346419
WY      0.147027 -0.479448  0.558769  1.024810
OR     -0.925874  1.862864 -1.133817  0.610478

In [83]:
### dfnew = df = pd.DataFrame(randn(5,4),index='A B C D E'.split(),columns=['COLX COLY COLW COLZ'])
dfnew = df = pd.DataFrame(randn(5,4),index='A B C D E'.split(),columns='COLW COLX COLY COLZ'.split())
dfnew

       COLW      COLX      COLY      COLZ
A  1.606780 -1.115710 -1.385379 -1.329660
B  0.041460 -0.411055 -0.771329  0.110477
C -0.804652  0.253548  0.649148  0.358941
D -1.080471  0.902398  0.161781  0.833029
E  0.975720 -0.388239  0.783316 -0.708954

In [86]:
df['States'] = newind
df

       COLW      COLX      COLY      COLZ States
A  1.606780 -1.115710 -1.385379 -1.329660     CA
B  0.041460 -0.411055 -0.771329  0.110477     NY
C -0.804652  0.253548  0.649148  0.358941     LA
D -1.080471  0.902398  0.161781  0.833029     WY
E  0.975720 -0.388239  0.783316 -0.708954     OR

In [87]:
df.set_index('States')

            COLW      COLX      COLY      COLZ
States
CA      1.606780 -1.115710 -1.385379 -1.329660
NY      0.041460 -0.411055 -0.771329  0.110477
LA     -0.804652  0.253548  0.649148  0.358941
WY     -1.080471  0.902398  0.161781  0.833029
OR      0.975720 -0.388239  0.783316 -0.708954

In [90]:
### change is not permanent because there was no inplace=True in the set_index method above
df

       COLW      COLX      COLY      COLZ States
A  1.606780 -1.115710 -1.385379 -1.329660     CA
B  0.041460 -0.411055 -0.771329  0.110477     NY
C -0.804652  0.253548  0.649148  0.358941     LA
D -1.080471  0.902398  0.161781  0.833029     WY
E  0.975720 -0.388239  0.783316 -0.708954     OR

In [91]:
### permanent index change
df.set_index('States',inplace=True)
df

            COLW      COLX      COLY      COLZ
States
CA      1.606780 -1.115710 -1.385379 -1.329660
NY      0.041460 -0.411055 -0.771329  0.110477
LA     -0.804652  0.253548  0.649148  0.358941
WY     -1.080471  0.902398  0.161781  0.833029
OR      0.975720 -0.388239  0.783316 -0.708954

In [93]:
df

            COLW      COLX      COLY      COLZ
States
CA      1.606780 -1.115710 -1.385379 -1.329660
NY      0.041460 -0.411055 -0.771329  0.110477
LA     -0.804652  0.253548  0.649148  0.358941
WY     -1.080471  0.902398  0.161781  0.833029
OR      0.975720 -0.388239  0.783316 -0.708954